Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Documentation enhancements and typo fixes
es_es: Ajustes y correcciones en la documentación

source: If there is a system error, returns the undefined value and sets C<$!> (errno).
es_es: Si hay un error del sistema, devuelve el valor indefinido y actualiza C<$!> (errno).

source: At the very least it will let some poor schmuck bounce on the % key in B<vi>.
es_es: Por lo menos esto hará que algún pobre inútil pueda usar la tecla % en B<vi>.

source: Note the I<in bytes>: even if the filehandle has been set to operate on characters (for example by using the C<:encoding(utf8)> open layer), tell() will return byte offsets, not character offsets (because that would render seek() and tell() rather slow).
es_es: Nota sobre lo de I<en bytes>: incluso si el identificador de archivo se ha puesto para operar en caracteres (por ejemplo usando la capa de open C<:encoding(utf8)>), tell() devolverá desplazamientos en bytes, no en caracteres (porque implementando esto convertirían en lentas a seek() y tell()).

source: <.>, where it means relative to the start of the string.
es_es: <.>, donde significa relativo al inicio de la cadena.

source: See below.
es_es: Vea más abajo.

source: The following escape sequences are available in constructs that interpolate, and in transliterations: X<\t> X<\n> X<\r> X<\f> X<\b> X<\a> X<\e> X<\x> X<\0> X<\c> X<\N> X<\N{}> X<\o{}>
es_es: Las siguientes secuencias de escape están disponibles en construcciones que interpolan, y en transliteraciones: X<\t> X<\n> X<\r> X<\f> X<\b> X<\a> X<\e> X<\x> X<\0> X<\c> X<\N> X<\N{}> X<\o{}>

source: Especially noteworthy are the bug in Calc that caused div and mod to fail for some large values, and the fixes to the handling of bad inputs.
es_es: Destaca de forma notable el fallo en Calc que causaba que div y mod fallaran para ciertos valores grandes, y los arreglos para el manejo de las entradas erróneas.

source: unless (open($input, "<", $filename)) { print STDERR "Can't open $filename: $!\n"; return;
es_es: unless (open($entrada, $archivo)) { print STDERR "No puedo abrir $archivo: $!\n"; return;

source: LABEL while (EXPR) BLOCK
es_es: ETIQUETA while (EXPR) BLOQUE

source: print($foo, exit); # Obviously not what you want.
es_es: print($foo, exit); # Obviamente, no lo que quiere hacer.

source: As of Perl 5.9.1, as a form of purely syntactic sugar, you can stack file test operators, in a way that C<-f -w -x $file> is equivalent to C<-x $file && -w _ && -f _>.
es_es: Como en Perl 5.9.1, una dulce forma, puramente sintáctica, puede apilar operadores de test de archivo, de forma que C<-f -w -x $archivo> es equivalente a C<-x $archivo && -w _ && -f _>.

source: According to the rule of dispatch based on the rightmost argument type, when an object overloading C<~~> appears on the right side of the operator, the overload routine will always be called (with a 3rd argument set to a true value, see L<overload>.) However, when the object will appear on the left, the overload routine will be called only when the rightmost argument is a simple scalar.
es_es: De acuerdo con la regla de reparto basada en el tipo del argumento de la derecha, cuando un objeto sobrecarga C<~~> aparece en el lado derecho del operador, la rutina de sobrecarga siempre será llamada (con un tercer argumento establecido a un valor verdadero, consulte L<overload>.) Sin embargo, cuando el objeto aparece a la izquierda, la rutina de sobrecarga será llamada sólo cuando el argumento de la derecha sea un escalar simple.

source: ExtUtils::MakeMaker remains at version 6.17, as later stable releases currently available on CPAN have some issues with core modules on some core platforms.
es_es: ExtUtils::MakeMaker se mantiene en la versión 6.17, debido a que las últimas versiones estables actualmente disponibles en CPAN tienen algunos problemas con los módulos básicos en algunas plataformas principales.

source: If that doesn't work, try looking in C</usr/local/lib/perl5/pod> for documentation.
es_es: Si esto no funciona, pruebe a buscar la documentación en C</usr/local/lib/perl5/pod>.

source: C<clock_nanosleep()> and C<clock()> functions added
es_es: Funciones añadidas C<clock_nanosleep()> y C<clock()>

source: Certain operations return list values in contexts wanting a list, and scalar values otherwise.
es_es: Ciertas operaciones devuelven una lista de valores en contextos que esperan una lista, y valores escalares en caso contrario.

source: This should reduce the number of calls to C<realloc> without actually using any extra memory.
es_es: Esto debería reducir el número de llamadas a C<realloc> sin tener que llegar a utilizar ningún otro espacio de memoria adicional.

source: There are two major contexts: list and scalar.
es_es: Hay dos tipos principales de contexto: lista y escalar.

source: But anything more complicated in the subscript will be interpreted as an expression.
es_es: Pero cualquier otra cosa más complicada, en el subíndice, se interpretará como una expresión.

source: See L<perlreapi> for more details.
es_es: Vea L<perlreapi> para más detalles.

source: See L<perlrepository> for more information.
es_es: Vea L<perlrepository> para más información.

source: # do something here...
es_es: # hacer algo aquí...

source: =head2 Is there an ISO or ANSI certified version of Perl?
es_es: =head2 ¿Existe alguna versión de Perl con certificación ISO o ANSI?

source: You just know it will be done sometime before or after the value is returned.
es_es: Sólo sabe que se hará en algún momento antes o después de que el valor sea devuelto.

source: It is I<only> meant to be used to assert that the running Perl is of a earlier version than its argument and I<not> to undo the feature-enabling side effects of C<use VERSION>.
es_es: I<Sólo> es para ser usado para asegurarse de que el perl que se está ejecutando es de una versión anterior a su argumento y I<no> para deshacer los efectos colaterales activados por C<use VERSION>.

source: ($days[3], $days[4], $days[5]) = qw/Wed Thu Fri/;
es_es: ($dias[3], $dias[4], $dias[5]) = qw/Mié Jue Vie/;

source: As of Perl 5.10.0, Perl supports several Python/PCRE-specific extensions to the regex syntax.
es_es: A partir de Perl 5.10.0, Perl soporta varias extensiones específicas Python/PCRE en la sintaxis de expresiones regulares.

source: The triple-dot operator, C<...>, sometimes called the "whatever operator", the "yada-yada operator", or the "I<et cetera>" operator, is a placeholder for code.
es_es: El operador triple punto, C<...>, a veces llamado el "operador lo-que-sea", el "operador blablablá", o el operador "I<etcétera>", es un marcador de posición para código.

source: Also, modifiers are resolved at compile time, so constructs like (?i:(?1)) or (?:(?i)(?1)) do not affect how the sub-pattern will be processed.
es_es: Además, los modificadores son resueltos en tiempo de compilación, por lo que construcciones como (?i:(?1)) o (?:(?i)(?1)) no afectan al modo en el que el sub-patrón será procesado.

source: This may cause programs which used to execute seemingly correctly without warnings and errors to fail when run under 5.8.1.
es_es: Esto puede hacer que los programas que lo usaban para ejecutar, de forma aparente, sin advertencias ni errores, fallen cuando se ejecute en 5.8.1.

source: makes $this an alias for $that, @this an alias for @that, %this an alias for %that, &this an alias for &that, etc. Much safer is to use a reference.
es_es: hace que $este sea un alias de $ese, @este sea un alias de @ese, %este sea un alias de %ese, etc. Es mucho más seguro usar una referencia.

source: =item do BLOCK X<do> X<block>
es_es: =item do BLOQUE X<do> X<block> X<bloque>

source: Perl is not currently able to do this when the multiple characters are in the pattern and are split between groupings, or when one or more are quantified.
es_es: Perl no es capaz, actualmente, de hacer esto cuando los grupos de caracteres están en el patrón y se dividen en agrupaciones, o cuando uno o más de ellos se han cuantificado.

source: Don't use C<exit> to abort a subroutine if there's any chance that someone might want to trap whatever error happened.
es_es: No use C<exit> para abortar una subrutina si existe la posibilidad de que alguien pueda capturar el error que ocurrió.

source: Internal cleanup and portability fixes
es_es: Limpieza interna y arreglos en la portabilidad

source: push $aref, qw(some more values); # WRONG!
es_es: push $aref, qw(some more values); # ¡MAL!

source: printf '<%.*s>', 0, "string"; # prints "<>"
es_es: printf '<%.*s>', 0, "cadena"; # imprime "<>"

source: This directory contains I<all> of the modules and their tests, unlike other core modules.
es_es: A diferencia de otros módulos del núcleo, este directorio contiene I<todos> los módulos y sus pruebas.

source: If you add new tests (or new modules with tests), you may need to update the F<t/TEST> file so that the tests are run.
es_es: Si agrega pruebas nuevas (o módulos nuevos con pruebas), es posible que tenga que actualizar el archivo F<t/TEST> para que se ejecuten.

source: temporarily makes $Here::blue an alias for $There::green, but doesn't make @Here::blue an alias for @There::green, or %Here::blue an alias for %There::green, etc. See L<perlmod/"Symbol Tables"> for more examples of this.
es_es: temporalmente hace que $Aqui::azul sea un alias de $Ahi::verde, pero no hace que @Aqui::azul sea un alias de @Ahi::verde, o que %Aqui::azul sea un alias de %Ahi::verde, etc. Ver L<perlmod/"Tablas de símbolos"> para más ejemplos sobre esto.

source: If more than one value is listed, the list must be placed in parentheses.
es_es: Si se lista más de un valor, esa lista debe ser puesta entre paréntesis.

source: It magically differs from a string containing the same characters: C<ref(qr/x/)> returns "Regexp", even though dereferencing the result returns undef.
es_es: De manera mágica se distingue de una cadena que contenga los mismos caracteres: C<ref(qr/x/)> devuelve "Regexp", incluso aunque desreferenciando el resultado devuelva undef.

source: You can use whitespace and the C<< => >> operator to lay them out more nicely:
es_es: Puede usar espacio en blanco y el operador C<< => >> para expresarlos de manera más clara:

source: You are not allowed to override the byte-order within a group that already has a byte-order modifier suffix.
es_es: No está autorizado a anular la ordenación de bytes dentro de un grupo que ya tenga un sufijo de modificador de ordenación de bytes.

source: This was only 4 times slower on a string with 1000000 C<a>s.
es_es: Esto sólo fue 4 veces más lento en una cadena con un 1.000.000 de C<a>.

source: undef %HASH; # forget %HASH ever existed
es_es: undef %HASH; # hacer que %HASH nunca existió

source: Your naming should be consistent.
es_es: Su nombramiento debe ser coherente.

source: To capture a command's STDERR but discard its STDOUT (ordering is important here):
es_es: Capturar el STDERR de un comando pero descartar su STDOUT (aquí, el orden es importante):

source: =item tie VARIABLE,CLASSNAME,LIST X<tie>
es_es: =item tie VARIABLE,CLASE,LISTA X<tie>

source: If you make changes to uconfig.sh, run
es_es: Si realiza cambios en uconfig.sh, ejecute

source: You might also want to check out L<perlfaq8/"How do I keep my own module/library directory?">.
es_es: Es posible que también le interese consultar "¿Qué tengo que hacer para mantener mi propio directorio de módulos/bibliotecas?" en L<perlfaq8>.

source: If C<srand()> is not called explicitly, it is called implicitly without a parameter at the first use of the C<rand> operator.
es_es: Si C<srand()> no es llamada de forma explícita, es llamada implícitamente en el primer uso del operador C<rand>.

source: $caps[$a] cmp $caps[$b]
es_es: $mayusculas[$a] cmp $mayusculas[$b]

source: You should set C<$VERSION> only once per package.
es_es: Debe ajustar el valor de C<$VERSION> solo una vez por paquete.

source: C<Devel::Peek> upgraded to version 1.03
es_es: C<Devel::Peek> actualizado a la versión 1.03

source: As a general rule, backslashes between C<\Q> and C<\E> may lead to counterintuitive results.
es_es: Como regla general, las contrabarras entre C<\Q> y C<\E> pueden dar lugar a resultados no intuitivos.

source: If you are trying to use this instead of C<write> to capture the output, you may find it easier to open a filehandle to a scalar (C<< open $fh, ">", \$output >>) and write to that instead.
es_es: Si está intentando usar esto en lugar de C<write> para capturar la salida, puede encontrar que sea más sencillo abrir un identificador de archivo en un escalar (C<< open $fh, ">", \$salida >>) y escribir en él.

source: S_IFMT($mode) the part of $mode containing the file type which can be bit-anded with (for example) S_IFREG or with the following functions
es_es: S_IFMT($modo) la parte de $modo conteniendo los bit del tipo de archivo que puede ser bit-andeado con (por ejemplo) S_IFREG o con las siguientes funciones

source: is just like
es_es: es igual que

source: =item say FILEHANDLE LIST X<say>
es_es: =item say IDENTIFICADOR_ARCHIVO LISTA X<say>

source: Binary "+" returns the sum of two numbers.
es_es: Binario "+" devuelve la suma de dos números.

source: perlce Perl notes for WinCE
es_es: perlce Notas para WinCE

source: Although if your manager accused you of seeking job security (or rapid insecurity) through inscrutable code, it would be hard to argue.
es_es: Pero su jefe le puede acusar de estar buscando un trabajo de seguridad (o rápida inseguridad) usando código inescrutable, y le será difícil excusarse.

source: 2401 6.2 all platform kernel rollup
es_es: 2401 6.2 acumulativo kernel para todas las plataformas

source: " if $on_a_tty }
es_es: " if $en_un_tty }

source: my %fruit_color = (
es_es: my %color_fruta = (

source: Without a NAME, it's an anonymous function declaration, so does return a value: the CODE ref of the closure just created.
es_es: Sin un NOMBRE, es una declaración de una función anónima, y devuelve un valor: la referencia al CÓDIGO de la clausura que acaba de crear.

source: For example, when processing a file like F</etc/termcap>.
es_es: Por ejemplo, cuando se procesa un archivo como F</etc/termcap>.

source: Do B<not> call C<srand()> (i.e., without an argument) more than once per process.
es_es: B<No> llame a srand() (e.d., sin un argumento) más de una vez por proceso.

source: =head2 Perl Books
es_es: =head2 Libros sobre Perl

source: =item C<(?|pattern)> X<(?|)> X<Branch reset>
es_es: =item C<(?|patrón)> X<(?|)> X<Branch reset> X<reinicio de rama>

source: =head3 Smart match and overloading
es_es: =head3 Coincidencia inteligente y sobrecarga

source: If DIRHANDLE is an undefined scalar variable (or array or hash element), the variable is assigned a reference to a new anonymous dirhandle; that is, it's autovivified.
es_es: Si IDENTIFICADOR_DIR es una variable escalar indefinida (o elemento array o hash), a la variable se le asigna una referencia a un nuevo identificador de directorio anónimo; es decir, es autovivificado.

source: B<Decoding> is the conversion from I<binary> to I<text>.
es_es: B<Descodificar> consiste en convertir I<binario> a I<texto>.

source: It is I<NOT>:
es_es: I<NO> es:

source: Its truth or falsehood determines how the modifier will behave.
es_es: Su verdad o falsedad determina cómo se comportará el modificador.

source: Only available after Perl 5.10.
es_es: Solamente disponible a partir de Perl 5.10.

source: This zero-width pattern is similar to C<(*PRUNE)>, except that on failure it also signifies that whatever text that was matched leading up to the C<(*SKIP)> pattern being executed cannot be part of I<any> match of this pattern.
es_es: Este patrón de ancho cero es similar a C<(*PRUNE)>, con la excepción de que en caso de fallo también significa que cualquier texto que haya sido encontrado antes del patrón C<(*SKIP)> que se está ejecutando, no puede formar parte de I<ninguna> búsqueda de este patrón.

source: or die "sysopen $path: $!";
es_es: or die "sysopen $ruta: $!";

source: If EXPR is omitted, merely returns the current umask.
es_es: Si EXPR se omite, simplemente devuelve la umask actual.

source: The v-less form (1.2.3) will become a "version object" when used with C<use>, C<require>, and C<$VERSION>.
es_es: La forma v-less (1.2.3) se convertirá en un "objeto de versión" cuando se utilice con C<use>, C<require> y C<$VERSION>.

source: The special variable C<$#array> tells you the index of the last element of an array:
es_es: La variable especial C<$#array> indica el índice del último elemento de un array:

source: \f form feed (FF)
es_es: \f avance de página (FF)

source: Any of the bit masks can also be undef.
es_es: Cualquiera de las máscaras de bits también puede ser undef.

source: Matches as C<SSS...S> (repeated as many times as necessary).
es_es: Coincide con C<SSS...S> (repetida tantas veces como sea necesario).

source: On Linux the legacy process name will be set with L<prctl(2)>, in addition to altering the POSIX name via C<argv[0]> as perl has done since version 4.000.
es_es: En Linux el nombre del proceso se establecerá con L<prctl(2)>, además de alterar el nombre a través de POSIX C<argv[0]> igual a como perl lo ha hecho desde la versión 4.000.

source: The directives alter the behaviour of the filehandle.
es_es: Las directivas alteran el comportamiento del identificador del archivo.

source: @contact = sort(find_records(@key));
es_es: @contacto = sort(busca_registros(@claves));

source: Opens a directory named EXPR for processing by C<readdir>, C<telldir>, C<seekdir>, C<rewinddir>, and C<closedir>.
es_es: Abre un directorio llamado EXPR para ser procesado por C<readdir>, C<telldir>, C<seekdir>, C<rewinddir>, y C<closedir>.

source: The operator may be assigned to if both the 2nd and 3rd arguments are legal lvalues (meaning that you can assign to them):
es_es: El operador puede ser asignado si tanto el segundo y tercer argumentos son I<ivalores> legales (lo que significa que les puede asignar valores):

source: returns a random integer between C<0> and C<9>, inclusive.
es_es: devuelve un número entero aleatorio entre C<0> y C<9>, inclusive.

source: NOTE: This section presents an abstract approximation of regular expression behavior.
es_es: NOTA: en esta sección se presenta una aproximación abstracta del comportamiento de las expresiones regulares.

source: The exit() function does not always exit immediately.
es_es: La función exit() no siempre sale de forma inmediata.

source: Q An unsigned quad value.
es_es: Q Un valor cuádruplo sin signo.

source: The only one you need to know about for now is C<$_> which is the "default variable".
es_es: La única que tiene que conocer por ahora es C<$_>, la "variable predeterminada".

source: C<eval_sv()> failing a taint test could corrupt the stack - this has been fixed.
es_es: C<eval_sv()> fallando una prueba de pringado podría corromper la pila - ha sido arreglado.

source: In Perl 5.8.0 all filehandles, including the standard filehandles, were implicitly set to be in Unicode UTF-8 if the locale settings indicated the use of UTF-8.
es_es: En Perl 5.8.0 todos los identificadores de archivo, incluidos los identificadores de archivo estándar, se establecían implícitamente en Unicode UTF-8 si la configuración regional indicaba el uso de UTF-8.

source: Regular expressions provide a terse and powerful programming language.
es_es: Las expresiones regulares proporcionan un lenguaje de programación conciso y poderoso.

source: See L<perlmod/"Perl Modules">.
es_es: Ver L<perlmod/"Módulos Perl">.

source: \N{name} named Unicode character or character sequence
es_es: \N{nombre} carácter o secuencia de caracteres Unicode

source: my @mixed = ("camel", 42, 1.23);
es_es: my @mezcla = ("camello", 42, 1.23);

source: This is especially significant, given that C<__DIE__> hooks can call C<die> again, which has the effect of changing their error messages:
es_es: Esto es especialmente significativo, dado que las llamadas C<__DIE__> pueden llamar de nuevo a C<die>, que tiene el efecto de cambiar los mensajes de error:

source: By default, a quantified subpattern is "greedy", that is, it will match as many times as possible (given a particular starting location) while still allowing the rest of the pattern to match.
es_es: De forma predeterminada, un sub-patrón cuantificado es "avaricioso", es decir, que coincidirá con tantas veces como sea posible (dado un determinado lugar de partida), mientras que aún permita que el resto del patrón coincida.

source: If you C<fork> without ever waiting on your children, you will accumulate zombies.
es_es: Si usted hace un C<fork> sin luego esperar a sus hijos, irá acumulando zombies.

source: perlsymbian Perl notes for Symbian
es_es: perlsymbian Notas para Symbian

# print { $files[$i] } "stuff ";
source: print { $files[$i] } "stuff\n";
es_es: print { $archivos[$i] } "cosas\n";

source: perlfunc Perl built-in functions
es_es: perlfunc Funciones integradas

source: VMS now supports C<getgrgid>.
es_es: VMS ahora soporta C<getgrgid>.

source: a negated expression C<!(...)> or C<not (...)>, or a logical exclusive-or C<(...) xor (...)>.
es_es: una expresión negada C<!(...)> o C<not (...)>, o una operación lógica exclusiva-or C<(...) xor (...)>.

source: 5 gid numeric group ID of file's owner
es_es: 5 gid ID numérico del grupo del propietario del archivo

source: Other modules should begin with a capital letter and use mixed case, but probably without underscores due to limitations in primitive file systems' representations of module names as files that must fit into a few sparse bytes.
es_es: Otros módulos deben comenzar con una letra mayúscula y usar luego una mezcla de mayúsculas y minúsculas, pero probablemente sin guiones bajos debido a limitaciones en la representación de nombres de módulos como archivos en sistemas de archivos primitivos que deben ajustarse a unos pocos bytes.

source: For instance
es_es: Por ejemplo

source: This prints out your environment like the printenv(1) program, but in a different order:
es_es: Esto imprime su entorno como el programa printenv(1), sólo que en un orden diferente:

source: $tX = sprintf("%.${POINTS}g", $X);
es_es: $tX = sprintf("%.${PUNTOS}g", $X);

source: The ability to write true lexically scoped pragmas will be introduced.
es_es: Se ha introducido la capacidad de escribir verdaderos pragmas con alcance léxico.

source: The debugger now works with lvalue subroutines.
es_es: El depurador ahora trabaja con subrutinas de tipo I<ivalor>.

# die "Sorry... ";
source: die "Sorry...\n";
es_es: die "Lo siento...\n";

source: May be interrupted if the process receives a signal such as C<SIGALRM>.
es_es: Puede ser interrumpido si el proceso recibe una señal como C<SIGALRM>.

source: See L<"pack"> for details.
es_es: Ver L<"pack"> para los detalles.

source: Any function in the list below may be used either with or without parentheses around its arguments.
es_es: Cualquier función en la lista de abajo puede ser usada tanto con paréntesis como sin ellos, rodeando sus argumentos.

source: process($file, "fh00");
es_es: procesa($archivo, "fh00");

source: Perl is a high-level programming language with an eclectic heritage written by Larry Wall and a cast of thousands.
es_es: Perl es un lenguaje de programación de alto nivel con una herencia ecléctica, creado por Larry Wall con la ayuda de miles de programadores.

source: README.openbsd - Perl version 5 on OpenBSD systems
es_es: README.openbsd - Perl versión 5 sobre sistemas OpenBSD

source: Apply C<int()> to the value returned by C<rand()> if you want random integers instead of random fractional numbers.
es_es: Aplique C<int()> al valor devuelto por C<rand()> si quiere obtener enteros aleatorios en lugar de fraccionarios.

source: =head2 Where should I post source code?
es_es: =head2 ¿Dónde debo publicar código fuente?
